Autodesk.Revit.DB.Electrical.CircuitNumberingOption
An enumerated type listing all the circuit numbering options.

Autodesk.Revit.DB.Electrical.CircuitNumberingOption.Continuous
Circuit numbering type is continuous from its parent panel.

Autodesk.Revit.DB.Electrical.CircuitNumberingOption.Default
Circuit numbering type is starting from one.